b = str(input("Введіть рядок не менше 20 символів: "))
while len(b) < 20:
    b = str(input("Рядок занадто короткий, спробуйте ще раз: "))
print("Результат зрізу кожного 3-го символу від 4-го символу з початку і до 20-го символу: ", b[3:20:3])
## Іванченко Олександр
N = int(input("N = "))

print(f"Введіть елементи масиву кількістью {N}:")

arr = [int(input()) for _ in range(N)]

print("Введений масив: ", arr)
sumParni = 0
for i in range(0,N,2):
  sumParni+=arr[i]
print("Сума елементів масиву з парними індексами" , sumParni)